# GetSurfaces Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCGeometryInfo..::..GetSurfaces Method
IFCGeometryInfo Class See Also
---
Gets the IfcSurface handles created representing the processed geometry and stored in this object.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public ICollection<IFCAnyHandle> GetSurfaces()
```

Visual Basic
---
```text
Public Function GetSurfaces As ICollection(Of IFCAnyHandle)
```

Visual C++
---
```text
public:
ICollection<IFCAnyHandle^>^ GetSurfaces()
```

# ### Return Value
The collection of surface handles.
# See Also
IFCGeometryInfo Class
Autodesk.Revit.DB.IFC Namespace